In [1]:
import json
import pandas as pd
import numpy as np
import re
from sqlalchemy import create_engine
from config import db_password
import time

In [2]:
file_dir = '../04222021-CleanedMHinTechData.csv'

In [3]:
f'{file_dir}filename'

'../04222021-CleanedMHinTechData.csvfilename'

In [4]:
file_dir_2 = '../salaries.csv'

In [5]:
mh_df=pd.read_csv('04222021-CleanedMHinTechData.csv', low_memory=False)
salaries_df=pd.read_csv('salaries.csv')

In [6]:
mh_df.head()

,self_employed,company_size,tech_company,primary_tech_role,mh_coverage_benefits,knowledge_mh_options,mh_communication,mh_resources,mh_anonymity,ease_mh_help_request,...,mh_interv,mh_interferes_without_tx,age,gender,country_live,state_live,country_work,state_work,position,remote
0,0,26-100,1.0,NaN,Not eligible for coverage / N/A,NaN,No,No,I don't know,Very easy,...,Not applicable to me,Not applicable to me,39,Male,United Kingdom,NaN,United Kingdom,NaN,Back-end Developer,Sometimes
1,0,25-Jun,1.0,NaN,No,Yes,Yes,Yes,Yes,Somewhat easy,...,Rarely,Sometimes,29,male,United States of America,Illinois,United States of America,Illinois,Back-end Developer|Front-end Developer,Never
2,0,25-Jun,1.0,NaN,No,NaN,No,No,I don't know,Neither easy nor difficult,...,Not applicable to me,Not applicable to me,38,Male,United Kingdom,NaN,United Kingdom,NaN,Back-end Developer,Always
3,1,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,Sometimes,Sometimes,43,male,United Kingdom,NaN,United Kingdom,NaN,Supervisor/Team Lead,Sometimes
4,0,25-Jun,0.0,1.0,Yes,Yes,No,No,No,Neither easy nor difficult,...,Sometimes,Sometimes,43,Female,United States of America,Illinois,United States of America,Illinois,Executive Leadership|Supervisor/Team Lead|Dev ...,Sometimes

In [7]:
salaries_df.head()

,Timestamp,Employer,Location,Job Title,Years at Employer,Years of Experience,Annual Base Pay,Signing Bonus,Annual Bonus,Annual Stock Value/Bonus,Gender,Additional Comments
0,3/21/2016 13:32,NaN,0,0,0,0,0,0.0,0.0,-,Male,NaN
1,3/21/2016 13:59,Sef,"San Francisco, CA",Founder,1,20,0,0.0,0.0,-,Male,Kill me
2,3/21/2016 19:46,Self,Williamsburg,Musician,2,8,0,0.0,0.0,-,Male,NaN
3,7/8/2016 15:34,NaN,"Barcelona, Spain",Backend engineer,2,13,33,0.0,0.0,-,Male,NaN
4,3/22/2016 1:30,NaN,Paris,Software Engineer,1,4,50,0.0,0.0,-,Male,NaN

In [8]:
mh_df.sample()

,self_employed,company_size,tech_company,primary_tech_role,mh_coverage_benefits,knowledge_mh_options,mh_communication,mh_resources,mh_anonymity,ease_mh_help_request,...,mh_interv,mh_interferes_without_tx,age,gender,country_live,state_live,country_work,state_work,position,remote
557,0,5-Jan,1.0,NaN,Not eligible for coverage / N/A,NaN,No,No,I don't know,Very easy,...,Not applicable to me,Not applicable to me,22,Male,United Kingdom,NaN,United Kingdom,NaN,Back-end Developer|DevOps/SysAdmin|Dev Evangel...,Never

In [9]:
mh_df.tail()

,self_employed,company_size,tech_company,primary_tech_role,mh_coverage_benefits,knowledge_mh_options,mh_communication,mh_resources,mh_anonymity,ease_mh_help_request,...,mh_interv,mh_interferes_without_tx,age,gender,country_live,state_live,country_work,state_work,position,remote
1428,1,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,Not applicable to me,Not applicable to me,34,Female,United States of America,New York,United States of America,New York,Other,Sometimes
1429,1,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,Sometimes,Often,56,MALE,United States of America,California,Afghanistan,NaN,Support,Sometimes
1430,0,100-500,1.0,NaN,Yes,Yes,Yes,Yes,I don't know,Somewhat difficult,...,Rarely,Sometimes,52,Male,United States of America,Georgia,United States of America,Georgia,Back-end Developer,Sometimes
1431,0,100-500,0.0,1.0,I don't know,I am not sure,No,Yes,I don't know,Somewhat difficult,...,Sometimes,Often,30,Female,United States of America,Nebraska,United States of America,Nebraska,DevOps/SysAdmin,Sometimes
1432,0,100-500,1.0,NaN,Yes,No,No,No,I don't know,Very difficult,...,Not applicable to me,Often,25,non-binary,Canada,NaN,Canada,NaN,Other,Sometimes

In [10]:
salaries_df.tail()

,Timestamp,Employer,Location,Job Title,Years at Employer,Years of Experience,Annual Base Pay,Signing Bonus,Annual Bonus,Annual Stock Value/Bonus,Gender,Additional Comments
3330,3/21/2016 15:01,NaN,NaN,Senior Gentoo Installation Specialist,NaN,NaN,10000000,NaN,NaN,NaN,Stallman,I have autism.
3331,3/22/2016 5:20,NaN,NaN,CEO,NaN,NaN,10000000,NaN,NaN,NaN,NaN,NaN
3332,7/13/2017 8:24,미라콤,서울,프로그래머,10,6,55000000,NaN,NaN,NaN,Male,NaN
3333,4/27/2016 20:04,NaN,NaN,test,NaN,NaN,75000000,NaN,NaN,NaN,NaN,NaN
3334,3/21/2016 22:02,NaN,Indonesia,ABAP,NaN,NaN,200000000,NaN,NaN,NaN,Male,NaN

In [11]:
salaries_df.columns.tolist()

['Timestamp',
 'Employer',
 'Location',
 'Job Title',
 'Years at Employer',
 'Years of Experience',
 'Annual Base Pay',
 'Signing Bonus',
 'Annual Bonus',
 'Annual Stock Value/Bonus',
 'Gender',
 'Additional Comments']

In [12]:
salaries_df[salaries_df['Job Title'].notnull()]

,Timestamp,Employer,Location,Job Title,Years at Employer,Years of Experience,Annual Base Pay,Signing Bonus,Annual Bonus,Annual Stock Value/Bonus,Gender,Additional Comments
0,3/21/2016 13:32,NaN,0,0,0,0,0,0.0,0.0,-,Male,NaN
1,3/21/2016 13:59,Sef,"San Francisco, CA",Founder,1,20,0,0.0,0.0,-,Male,Kill me
2,3/21/2016 19:46,Self,Williamsburg,Musician,2,8,0,0.0,0.0,-,Male,NaN
3,7/8/2016 15:34,NaN,"Barcelona, Spain",Backend engineer,2,13,33,0.0,0.0,-,Male,NaN
4,3/22/2016 1:30,NaN,Paris,Software Engineer,1,4,50,0.0,0.0,-,Male,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...
3330,3/21/2016 15:01,NaN,NaN,Senior Gentoo Installation Specialist,NaN,NaN,10000000,NaN,NaN,NaN,Stallman,I have autism.
3331,3/22/2016 5:20,NaN,NaN,CEO,NaN,NaN,10000000,NaN,NaN,NaN,NaN,NaN
3332,7/13/2017 8:24,미라콤,서울,프로그래머,10,6,55000000,NaN,NaN,NaN,Male,NaN
3333,4/27/2016 20:04,NaN,NaN,test,NaN,NaN,75000000,NaN,NaN,NaN,NaN,NaN
3334,3/21/2016 22:02,NaN,Indonesia,ABAP,NaN,NaN,200000000,NaN,NaN,NaN,Male,NaN

In [13]:
sorted(salaries_df.columns.tolist())

['Additional Comments',
 'Annual Base Pay',
 'Annual Bonus',
 'Annual Stock Value/Bonus',
 'Employer',
 'Gender',
 'Job Title',
 'Location',
 'Signing Bonus',
 'Timestamp',
 'Years at Employer',
 'Years of Experience']

In [14]:
[[column,salaries_df[column].isnull().sum()] for column in salaries_df.columns]

[['Timestamp', 0],
 ['Employer', 1547],
 ['Location', 461],
 ['Job Title', 0],
 ['Years at Employer', 326],
 ['Years of Experience', 290],
 ['Annual Base Pay', 0],
 ['Signing Bonus', 1138],
 ['Annual Bonus', 1037],
 ['Annual Stock Value/Bonus', 1444],
 ['Gender', 159],
 ['Additional Comments', 2873]]

In [15]:
[column for column in salaries_df.columns if salaries_df[column].isnull().sum() < len(salaries_df) * 0.9]

['Timestamp',
 'Employer',
 'Location',
 'Job Title',
 'Years at Employer',
 'Years of Experience',
 'Annual Base Pay',
 'Signing Bonus',
 'Annual Bonus',
 'Annual Stock Value/Bonus',
 'Gender',
 'Additional Comments']

In [16]:
salaries_columns_to_keep = [column for column in salaries_df.columns if salaries_df[column].isnull().sum() < len(salaries_df) * 0.9]
salaries_df = salaries_df[salaries_columns_to_keep]

In [17]:
salaries_df.dtypes

Timestamp                    object
Employer                     object
Location                     object
Job Title                    object
Years at Employer            object
Years of Experience          object
Annual Base Pay               int64
Signing Bonus               float64
Annual Bonus                float64
Annual Stock Value/Bonus     object
Gender                       object
Additional Comments          object
dtype: object

In [18]:
annual_base_pay = salaries_df['Annual Base Pay'].dropna()

In [23]:
salaries_df.drop(['Timestamp', 'Employer','Additional Comments','Years at Employer','Annual Stock Value/Bonus'], axis=1)

,Location,Job Title,Years of Experience,Annual Base Pay,Signing Bonus,Annual Bonus,Gender
0,0,0,0,0,0.0,0.0,Male
1,"San Francisco, CA",Founder,20,0,0.0,0.0,Male
2,Williamsburg,Musician,8,0,0.0,0.0,Male
3,"Barcelona, Spain",Backend engineer,13,33,0.0,0.0,Male
4,Paris,Software Engineer,4,50,0.0,0.0,Male
...,...,...,...,...,...,...,...
3330,NaN,Senior Gentoo Installation Specialist,NaN,10000000,NaN,NaN,Stallman
3331,NaN,CEO,NaN,10000000,NaN,NaN,NaN
3332,서울,프로그래머,6,55000000,NaN,NaN,Male
3333,NaN,test,NaN,75000000,NaN,NaN,NaN
3334,Indonesia,ABAP,NaN,200000000,NaN,NaN,Male

In [25]:
# Examining Job Title of Salaries Df
salaries_df['Job Title'].value_counts()

Software Engineer           513
Senior Software Engineer    187
Software Developer          162
Developer                    61
Web Developer                53
                           ...
Font End Developer            1
Para                          1
Jr Engineer                   1
process engineer              1
System Analyst                1
Name: Job Title, Length: 1282, dtype: int64

In [26]:
# Examining Job Title of MH Df
mh_df['position'].value_counts()

Back-end Developer                                                                                                                   263
Front-end Developer                                                                                                                  125
Other                                                                                                                                112
Supervisor/Team Lead                                                                                                                  68
Back-end Developer|Front-end Developer                                                                                                61
                                                                                                                                    ...
One-person shop|Designer|Front-end Developer|Back-end Developer                                                                        1
Supervisor/Team Lead|DevOps/SysAdmin|Back-end Developer|Support                                                                        1
Supervisor/Team Lead|Sales                                                                                                             1
One-person shop|Front-end Developer|Back-end Developer|Sales|Support|DevOps/SysAdmin                                                   1
Other|Supervisor/Team Lead|Dev Evangelist/Advocate|DevOps/SysAdmin|Support|Back-end Developer|Front-end Developer|One-person shop      1
Name: position, Length: 264, dtype: int64

In [ ]:
ratings.info(null_counts=True)

In [ ]:
pd.to_datetime(ratings['timestamp'], unit='s')

In [ ]:
ratings['timestamp'] = pd.to_datetime(ratings['timestamp'], unit='s')

In [ ]:
pd.options.display.float_format = '{:20,.2f}'.format
ratings['rating'].plot(kind='hist')
ratings['rating'].describe()

In [ ]:
movies_df = pd.merge(wiki_movies_df, movies_metadata, on='imdb_id', suffixes=['_wiki','_kaggle'])

In [ ]:
movies_df[['title_wiki','title_kaggle']]

In [ ]:
movies_df[movies_df['title_wiki'] != movies_df['title_kaggle']][['title_wiki','title_kaggle']]

In [ ]:
# Show any rows where title_kaggle is empty
movies_df[(movies_df['title_kaggle'] == '') | (movies_df['title_kaggle'].isnull())]

In [ ]:
movies_df.fillna(0).plot(x='running_time', y='runtime', kind='scatter')

In [ ]:
movies_df.fillna(0).plot(x='budget_wiki',y='budget_kaggle', kind='scatter')

In [ ]:
movies_df.fillna(0).plot(x='box_office', y='revenue', kind='scatter')

In [ ]:
movies_df.fillna(0)[movies_df['box_office'] < 10**9].plot(x='box_office', y='revenue', kind='scatter')

In [ ]:
movies_df[['release_date_wiki','release_date_kaggle']].plot(x='release_date_wiki', y='release_date_kaggle', style='.')

In [ ]:
movies_df[(movies_df['release_date_wiki'] > '1996-01-01') & (movies_df['release_date_kaggle'] < '1965-01-01')]

In [ ]:
movies_df[(movies_df['release_date_wiki'] > '1996-01-01') & (movies_df['release_date_kaggle'] < '1965-01-01')].index

In [ ]:
movies_df = movies_df.drop(movies_df[(movies_df['release_date_wiki'] > '1996-01-01') & (movies_df['release_date_kaggle'] < '1965-01-01')].index)

In [ ]:
movies_df[movies_df['release_date_wiki'].isnull()]

In [ ]:
movies_df['Language'].apply(lambda x: tuple(x) if type(x) == list else x).value_counts(dropna=False)

In [ ]:
movies_df['original_language'].value_counts(dropna=False)

In [ ]:
movies_df[['Production company(s)','production_companies']]

In [ ]:
movies_df.drop(columns=['title_wiki','release_date_wiki','Language','Production company(s)'], inplace=True)

In [ ]:
def fill_missing_kaggle_data(df, kaggle_column, wiki_column):
    df[kaggle_column] = df.apply(
        lambda row: row[wiki_column] if row[kaggle_column] == 0 else row[kaggle_column]
        , axis=1)
    df.drop(columns=wiki_column, inplace=True)

In [ ]:
fill_missing_kaggle_data(movies_df, 'runtime', 'running_time')
fill_missing_kaggle_data(movies_df, 'budget_kaggle', 'budget_wiki')
fill_missing_kaggle_data(movies_df, 'revenue', 'box_office')
movies_df

In [ ]:
for col in movies_df.columns:
    lists_to_tuples = lambda x: tuple(x) if type(x) == list else x
    value_counts = movies_df[col].apply(lists_to_tuples).value_counts(dropna=False)
    num_values = len(value_counts)
    if num_values == 1:
        print(col)

In [ ]:
movies_df['video'].value_counts(dropna=False)

In [ ]:
movies_df = movies_df.loc[:, ['imdb_id','id','title_kaggle','original_title','tagline','belongs_to_collection','url','imdb_link',
                       'runtime','budget_kaggle','revenue','release_date_kaggle','popularity','vote_average','vote_count',
                       'genres','original_language','overview','spoken_languages','Country',
                       'production_companies','production_countries','Distributor',
                       'Producer(s)','Director','Starring','Cinematography','Editor(s)','Writer(s)','Composer(s)','Based on'
                      ]]

In [ ]:
movies_df.rename({'id':'kaggle_id',
                  'title_kaggle':'title',
                  'url':'wikipedia_url',
                  'budget_kaggle':'budget',
                  'release_date_kaggle':'release_date',
                  'Country':'country',
                  'Distributor':'distributor',
                  'Producer(s)':'producers',
                  'Director':'director',
                  'Starring':'starring',
                  'Cinematography':'cinematography',
                  'Editor(s)':'editors',
                  'Writer(s)':'writers',
                  'Composer(s)':'composers',
                  'Based on':'based_on'
                 }, axis='columns', inplace=True)

In [ ]:
rating_counts = ratings.groupby(['movieId','rating'], as_index=False).count()

In [ ]:
rating_counts = ratings.groupby(['movieId','rating'], as_index=False).count() \
                .rename({'userId':'count'}, axis=1)

In [ ]:
rating_counts = ratings.groupby(['movieId','rating'], as_index=False).count() \
                .rename({'userId':'count'}, axis=1) \
                .pivot(index='movieId',columns='rating', values='count')

In [ ]:
rating_counts.columns = ['rating_' + str(col) for col in rating_counts.columns]

In [ ]:
movies_with_ratings_df = pd.merge(movies_df, rating_counts, left_on='kaggle_id', right_index=True, how='left')

In [ ]:
movies_with_ratings_df[rating_counts.columns] = movies_with_ratings_df[rating_counts.columns].fillna(0)

In [ ]:
db_string = f"postgres://postgres:{db_password}@127.0.0.1:5432/movie_data"

In [ ]:
pip install psycopg2-binary

In [ ]:
engine = create_engine(db_string)

In [ ]:
movies_df.to_sql(name='movies', con=engine)

In [ ]:
rows_imported = 0
# get the start_time from time.time()
start_time = time.time()
for data in pd.read_csv(f'{file_dir}ratings.csv', chunksize=1000000):
    print(f'importing rows {rows_imported} to {rows_imported + len(data)}...', end='')
    data.to_sql(name='ratings', con=engine, if_exists='append')
    rows_imported += len(data)

    # add elapsed time to final print out
    print(f'Done. {time.time() - start_time} total seconds elapsed')